In [19]:
# import library
import pandas as pd

In [20]:
# read data
df = pd.read_csv("dataset/sales_data.csv")

In [21]:
# show 5 data
df.head()

,country,type,channel,priority,date,id,ship_date,units_sold,unit_price,unit_cost
0,Tuvalu,Baby Food,Offline,H,2010-05-28,669165933,6/27/10,9925.0,255.28,159.42
1,Grenada,Cereal,Online,C,2012-08-22,963881480,9/15/12,NaN,205.70,117.11
2,Russia,NaN,Offline,L,2014-05-02,341417157,5/8/14,1779.0,651.21,524.96
3,Sao Tome and Principe,Fruits,Online,C,2014-06-20,514321792,7/5/14,8102.0,9.33,6.92
4,Rwanda,Office Supplies,Offline,L,NaN,115456712,2/6/13,5062.0,651.21,524.96

In [23]:
# statistic summary
df.describe()

                 id   units_sold   unit_price   unit_cost
count  1.030000e+02   102.000000   103.000000  103.000000
mean   5.562142e+08  5061.088235   366.054272  187.617087
std    2.570006e+08  2842.876315   979.524308  186.814511
min    1.146066e+08    97.000000     9.330000    3.670000
25%    3.435679e+08  2489.250000    81.730000   35.840000
50%    5.594271e+08  5382.500000   154.060000   97.440000
75%    7.882880e+08  7338.250000   437.200000  263.330000
max    9.940222e+08  9925.000000  9925.000000  524.960000

In [24]:
# filter by country
df[df["country"]=="Russia"]

# filter by type
df[df["type"]=="Personal Care"]

,country,type,channel,priority,date,id,ship_date,units_sold,unit_price,unit_cost
8,Republic of the Congo,Personal Care,Offline,M,2015-07-14,770463311,8/25/15,6070.0,81.73,56.67
14,Mongolia,Personal Care,Offline,C,2014-02-19,832401311,2/23/14,4901.0,81.73,56.67
24,Moldova,Personal Care,Online,L,2016-05-07,740147912,5/10/16,5070.0,81.73,56.67
31,South Sudan,Personal Care,Offline,C,2013-12-29,406502997,1/28/14,2125.0,81.73,56.67
35,Costa Rica,Personal Care,Offline,L,2017-05-08,456767165,5/21/17,6409.0,81.73,56.67
40,Niger,Personal Care,Online,H,2017-03-11,699285638,3/28/17,3015.0,81.73,56.67
47,Switzerland,Personal Care,Online,M,2010-12-23,617667090,1/31/11,273.0,81.73,56.67
66,Gabon,Personal Care,Offline,L,2012-07-08,228944623,7/9/12,8656.0,81.73,56.67
85,Mexico,Personal Care,Offline,L,2012-02-17,430915820,3/20/12,6422.0,81.73,56.67
98,Mexico,Personal Care,Offline,M,2015-07-30,559427106,8/8/15,5767.0,81.73,56.67
101,Philiphines,Personal Care,Offline,Fruits,2015-07-30,559427126,8/8/15,300.0,20.73,3.67
102,Mexico,Personal Care,Offline,M,2015-07-30,559427106,8/8/15,5767.0,81.73,56.67

In [28]:
# Data Cleaning

# show missing value
df[df.isna().any(axis=1)]

# drop missing value
df = df.dropna()
df.head()

,country,type,channel,priority,date,id,ship_date,units_sold,unit_price,unit_cost
0,Tuvalu,Baby Food,Offline,H,2010-05-28,669165933,6/27/10,9925.0,255.28,159.42
3,Sao Tome and Principe,Fruits,Online,C,2014-06-20,514321792,7/5/14,8102.0,9.33,6.92
5,Solomon Islands,Baby Food,Online,C,2015-02-04,547995746,2/21/15,2974.0,255.28,159.42
6,Angola,Household,Offline,M,2011-04-23,135425221,4/27/11,4187.0,668.27,502.54
7,Burkina Faso,Vegetables,Online,H,2012-07-17,871543967,7/27/12,8082.0,154.06,90.93

In [7]:
# check unique column type
df["type"].unique()

# replace froots to fruits (typo)
df.loc[df["type"]=="Froots", "type"] = "Fruits"

# show result
df["type"].unique()

array(['Baby Food', 'Fruits', 'Household', 'Vegetables', 'Personal Care',
       'Cereal', 'Clothes', 'Cosmetics', 'Beverages', 'Meat', 'Snacks',
       'Office Supplies'], dtype=object)

In [30]:
# duplicate data
df[df.duplicated()]

# check record yang duplicate
df[df["id"]==559427106]

# drop duplicate
df = df.drop_duplicates()

# duplicate data again
df[df.duplicated()]

Empty DataFrame
Columns: [country, type, channel, priority, date, id, ship_date, units_sold, unit_price, unit_cost]
Index: []

In [31]:
# check unique column priority
df["priority"].unique()

# drop Fruits (typo)
df = df[df["priority"] != "Fruits"]
df

,country,type,channel,priority,date,id,ship_date,units_sold,unit_price,unit_cost
0,Tuvalu,Baby Food,Offline,H,2010-05-28,669165933,6/27/10,9925.0,255.28,159.42
3,Sao Tome and Principe,Fruits,Online,C,2014-06-20,514321792,7/5/14,8102.0,9.33,6.92
5,Solomon Islands,Baby Food,Online,C,2015-02-04,547995746,2/21/15,2974.0,255.28,159.42
6,Angola,Household,Offline,M,2011-04-23,135425221,4/27/11,4187.0,668.27,502.54
7,Burkina Faso,Vegetables,Online,H,2012-07-17,871543967,7/27/12,8082.0,154.06,90.93
...,...,...,...,...,...,...,...,...,...,...
96,Malaysia,Fruits,Offline,L,2011-11-11,810711038,12/28/11,6267.0,9.33,6.92
97,Sierra Leone,Vegetables,Offline,C,2016-06-01,728815257,6/29/16,1485.0,154.06,90.93
98,Mexico,Personal Care,Offline,M,2015-07-30,559427106,8/8/15,5767.0,81.73,56.67
99,Mozambique,Household,Offline,L,2012-02-10,665095412,2/15/12,5367.0,668.27,502.54
100,Indonesia,Froots,Online,H,2012-08-22,669165412,9/15/12,97.0,9925.00,159.42

In [33]:
# export hasil cleaning
df.to_csv("sales_clean.csv")

In [34]:
# 1. country yang profit paling besar?
# rumus : profit = revenue - total_cost
df["revenue"] = df["units_sold"] * df["unit_price"]
df["total_cost"] = df["units_sold"] * df["unit_cost"]
df["profit"] = df["revenue"] - df["total_cost"]
df.groupby("country")["profit"].sum().reset_index().sort_values("profit", ascending=False).head(5)

     country      profit
16  Djibouti  2425317.87
46   Myanmar  1802771.70
51  Pakistan  1719922.04
56    Samoa   1678540.98
23  Honduras  1609947.52

In [38]:
# 2. Rata-rata dari type vegetables di bulan februari?

# cek tipe data
df.dtypes

# rubah type data date object menjadi datetime
df["date"] = pd.to_datetime(df["date"])
df.dtypes

# extract month dari datetime
df["month"] = df["date"].dt.month

# group by month 
df.groupby('month')['profit'].mean().reset_index()

    month         profit
0       1  402408.145714
1       2  536081.084167
2       3  232087.765000
3       4  528912.038889
4       5  435809.355000
5       6  218537.943000
6       7  464871.921667
7       8  319532.892500
8       9  468833.206000
9      10  409720.295455
10     11  717511.183333
11     12  471246.014000

In [41]:
# 3. Bulan berapa sales paling tinggi?
df.groupby('month')['profit'].sum().reset_index().sort_values('profit', ascending=False)

    month      profit
10     11  6457600.65
1       2  6432973.01
6       7  5578463.06
3       4  4760208.35
9      10  4506923.25
4       5  4358093.55
0       1  2816857.02
11     12  2356230.07
8       9  2344166.03
5       6  2185379.43
7       8  1278131.57
2       3   928351.06

In [43]:
# 4. list 5 id teratas berdasarkan profit?
df.groupby('id')['profit'].sum().reset_index().sort_values('profit', ascending=False)

           id      profit
16  231145322  1719922.04
61  670854651  1678540.98
23  331438481  1541705.29
18  249693334  1505888.07
45  522840487  1487261.02
..        ...         ...
77  814711606     7828.12
53  617667090     6841.38
3   142278373     5270.67
78  816200339     1621.93
42  513417565     1258.02

[98 rows x 2 columns]

In [55]:
# 5. produk paling populer di Australia?
df[df["country"] == "Australia"].groupby(["country","type"]).agg({"units_sold":"sum"}).sort_values("units_sold",ascending=False)

                           units_sold
country   type
Australia Beverages            9389.0
          Office Supplies      2924.0
          Cereal                682.0